app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = $1  [["status", "in_progress"]]
---
  def index
    # to define order in datatable
    in_progress = Task.where(status: "in_progress")
    others = Task.where("status != ?", "in_progress")