app/controllers/tasks_controller.rb

  def index
  	@tasks = Task.all
---
SELECT "tasks".* FROM "tasks" WHERE (status != 'in_progress')

  def create
    @task = Task.create(tasks_params)
---
INSERT INTO "tasks" ("name", "start_at", "status") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Terminar as funcionalidades básicas"], ["start_at", "2019-12-14 12:15:00"], ["status", "in_progress"]]

  def successfully_completed
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]

  def cancelled
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    @task = Task.find(params[:id])

    if params[:task][:end_at].present?
      Task.transaction  do
        @task.end_at = params[:task][:end_at]
        @task.status = "finished"
        flash[:notice] = "Tarefa finalizada com sucesso"
      end

    elsif params[:task][:cancellation_justification].present?
      Task.transaction do
        @task.cancellation_justification= params[:task][:cancellation_justification]
        @task.status = "canceled"
        flash[:notice] = "Tarefa cancelada com sucesso"
      end
    end
    @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "end_at" = $2 WHERE "tasks"."id" = $3  [["status", "finished"], ["end_at", "2015-08-23 12:20:00"], ["id", 1]]